In [1]:
import pandas as pd
from datetime import datetime

In [7]:
dt = datetime(2021,12,31, 1,2,3)
print(dt.year, dt.month, dt.day, dt.hour, dt.minute, dt.second)

2021 12 31 1 2 3

In [19]:
data = [{'이름':'곽영미', '나이':49, '생일': '1972-01-01'},
        {'이름':'하나영', '나이':45, '생일': '1978-10-23'},
        {'이름':'박은정', '나이':48, '생일': '1973-05-12'}]
df = pd.DataFrame(data)
display(df)
df.info() # 생일이 object로 되어 있으므로 시계열을 사용할 수 없다

    이름  나이          생일
0  곽영미  49  1972-01-01
1  하나영  45  1978-10-23
2  박은정  48  1973-05-12

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   나이      3 non-null      int64
 2   생일      3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [21]:
data = [{'이름':'곽영미', '나이':49, '생일': '1972-01-01'},
        {'이름':'하나영', '나이':45, '생일': '1978-10-23'},
        {'이름':'박은정', '나이':48, '생일': '1973-05-12'}]
df = pd.DataFrame(data)
df.생일 = pd.to_datetime(df.생일) # 포멧: 년-월-일 시:분:초 or 년/월/일 or 년.월.일
display(df)
df.info()

    이름  나이         생일
0  곽영미  49 1972-01-01
1  하나영  45 1978-10-23
2  박은정  48 1973-05-12

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   나이      3 non-null      int64
 2   생일      3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 200.0+ bytes

In [32]:
data = [{'이름':'곽영미', '나이':49, '생일': datetime.strptime('1972-01-01',"%Y-%m-%d")},
        {'이름':'하나영', '나이':45, '생일': datetime.strptime('1978-10-23',"%Y-%m-%d")},
        {'이름':'박은정', '나이':48, '생일': datetime.strptime('1973-05-12',"%Y-%m-%d")}]
df = pd.DataFrame(data)
display(df)
df.info() # 생일의 datetime64로

    이름  나이         생일
0  곽영미  49 1972-01-01
1  하나영  45 1978-10-23
2  박은정  48 1973-05-12

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   나이      3 non-null      int64
 2   생일      3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 200.0+ bytes

In [38]:
# df.set_index('생일', inplace=True)
display(df.query("생일 > '1973-01-01'"))
display(df.index)

             이름  나이
생일
1978-10-23  하나영  45
1973-05-12  박은정  48

DatetimeIndex(['1972-01-01', '1978-10-23', '1973-05-12'], dtype='datetime64[ns]', name='생일', freq=None)